IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsionEc2
ULS Check Torsion Ec2

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsionEc2.Ted
Design value of the applied torsional moment

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsionEc2.Trdc
torsional cracking moment

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsionEc2.Trdmax
design torsional resistance moment

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsionEc2.Trds
design torsional resistance moment of shear reinforcement

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsionEc2.Trd
decisive design torsional resistance